app/controllers/fetch_controller.rb

    def search_businesses
        term = params[:term]
        location = params[:location]
        response = RestClient::Request.execute(
            method: "GET",
            url: "https://api.yelp.com/v3/businesses/search?term=#{term}&location=#{location}",
            headers: { Authorization: "Bearer #{ENV["YELP_API_KEY"]}" }
        )
        results = JSON.parse(response.body)
        businesses = results['businesses']
        send_businesses_to_database = businesses.each do |business|
            Business.find_or_create_by(
            name: business['name'],
            image_url: business['image_url'],
            category: business['categories'][0]['title'],
            rating: business['rating'],
            price: business['price'],
            address1: business['location']['address1'],
            address2: business['location']['address2'],
            city: business['location']['city'],
            zip_code: business['location']['zip_code'],
            country: business['location']['country'],
            state: business['location']['state']
            )
---
SELECT "businesses".* FROM "businesses"
SELECT COUNT(*) FROM "businesses" WHERE "businesses"."city" = ? AND "businesses"."category" = ?  [["city", "Houston"], ["category", "American"]]
INSERT INTO "businesses" ("name", "image_url", "category", "rating", "price", "address1", "address2", "city", "zip_code", "country", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."name" = ? AND "businesses"."image_url" = ? AND "businesses"."category" = ? AND "businesses"."rating" = ? AND "businesses"."price" = ? AND "businesses"."url" = ? AND "businesses"."address1" = ? AND "businesses"."address2" IS NULL AND "businesses"."city" = ? AND "businesses"."zip_code" = ? AND "businesses"."country" = ? AND "businesses"."state" = ? LIMIT ?

    def search_events
        location = params[:location]
        response = RestClient::Request.execute(
            method: "GET",
            url: "https://api.yelp.com/v3/events?location=#{location}",
            headers: { Authorization: "Bearer #{ENV["YELP_API_KEY"]}" }
        )
        results = JSON.parse(response.body)
        events = results['events']
        send_events_to_database = events.each do |event|
            Event.find_or_create_by(
            attending_count: event['attending_count'],
            category: event['category'],
            cost: event['cost'],
            description: event['description'],
            image_url: event['image_url'],
            interested_count: event['interested_count'],
            is_canceled: event['is_canceled'],
            is_free: event['is_free'],
            name: event['name'],
            time_end: event['time_end'],
            time_start: event['time_start'],
            address1: event['location']['address1'],
            address2: event['location']['address2'],
            city: event['location']['city'],
            zip_code: event['location']['zip_code'],
            country: event['location']['country'],
            state: event['location']['state']
            )
---
SELECT "events".* FROM "events"
INSERT INTO "events" ("attending_count", "category", "cost", "description", "image_url", "interested_count", "is_canceled", "is_free", "name", "time_end", "time_start", "address1", "address2", "city", "zip_code", "country", "state", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19) RETURNING "id"
SELECT  "events".* FROM "events" WHERE "events"."attending_count" = ? AND "events"."category" = ? AND "events"."cost" IS NULL AND "events"."description" = ? AND "events"."image_url" = ? AND "events"."interested_count" = ? AND "events"."is_canceled" = ? AND "events"."is_free" = ? AND "events"."name" = ? AND "events"."time_end" IS NULL AND "events"."time_start" = ? AND "events"."address1" = ? AND "events"."address2" = ? AND "events"."city" = ? AND "events"."zip_code" = ? AND "events"."country" = ? AND "events"."state" = ? LIMIT ?

    def business_reviews
    id = params[:id]
    response = RestClient::Request.execute(
        method: 'GET',
        url: "https://api.yelp.com/v3/businesses/#{id}/reviews",
        headers: {Authorization: "Bearer #{ENV["YELP_API_KEY"]}"}
    )
    results = JSON.parse(response)
    reviews = results['reviews']
    send_reviews_to_database = reviews.each do |review|
        Review.find_or_create_by(
        text: review['text'],
        rating: review['rating'],
        user_name: review['user']['name']
        )
---
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."text" = $1 AND "reviews"."rating" = $2 AND "reviews"."user_name" = $3 LIMIT $4